<template>
  <div class="privacy-policy" :style="{ 'height': height }">
    <h1 style="text-align: center;">模型服务协议</h1>

    <h2>用户协议</h2>
    <p>欢迎签署本《用户协议》（下称"本协议"）并使用千问千答服务。</p>
    
    <h2>相关定义说明</h2>
    <ul>
      <li>千问千答：指问答对话生成平台产品。</li>
      <li>千问千答服务提供者：指千问千答的互联网信息及软件技术服务提供者。</li>
      <li>用户或您：指使用千问千答产品或服务的人。</li>
    </ul>

    <h2>协议适用范围</h2>
    <p>本协议由您和千问千答服务提供者签署，自您确认接受之时起或自您使用千问千答的行为发生之时起生效。除非另有明确规定，平台新增的任何新功能、新产品、新服务，均无条件地适用本协议。</p>
    
    <h2>账号与使用说明</h2>
    <p>在您使用千问千答服务时，需要您先进行用户注册。</p>

    <h2>用户资格说明</h2>
    <p>请确认在您开始注册程序使用千问千答服务前，您已具备中华人民共和国法律规定的与您行为相适应的民事行为能力。若您不具备前述与您行为相适应的民事行为能力而进行用户注册，则您及您的监护人应依照法律规定承担因此而导致的一切后果。</p>
    <p>您知悉，无民事行为能力人、限制民事行为能力人不当注册为千问千答用户的，其与千问千答之间的服务协议自始无效，一经发现，千问千答有权立即停止为该用户服务或注销该用户账号。</p>
    
    <h2>账户注册说明</h2>
    <p>账户注册是指用户登录千问千答，按要求填写相关信息并确认同意履行本协议的过程。如有证据证明或千问千答根据相关规则判断您存在不当注册或不当使用多个千问千答账户的情形，千问千答可采取冻结或关闭账户、拒绝提供服务等措施，如给千问千答及相关方造成损失的，您还应承担赔偿责任。</p>
  
    <h2>更新维护说明</h2>
    <p>您应当及时更新您提供的信息，在法律有明确规定要求千问千答作为平台服务提供者必须对部分用户的信息进行核实的情况下，千问千答将依法不时地对您的信息进行检查核实，您应当配合提供最新、真实、完整、有效的信息。</p>
    <p>千问千答可向您发出询问或要求整改的通知，并要求您进行重新认证，直至中止、终止对您提供部分或全部千问千答平台服务，当出现如下情况时，千问千答对此不承担任何责任：</p>
    <ul>
      <li>如千问千答按您最后一次提供的信息与您联系未果；</li>
      <li>您未按千问千答的要求及时提供信息；</li>
      <li>您提供的信息存在明显不实或行政司法机关核实您提供的信息无效的，您将承担因此对您自身、他人及千问千答造成的全部损失与不利后果。</li>
    </ul>

    <h2>平台的权利和义务</h2>
    <ul>
      <li>1. 千问千答有义务在现有技术上维护整个平台的正常运行，并努力提升和改进技术，保障您的产品和服务使用体验。</li>
      <li>2. 对于您在注册使用千问千答平台时遇到的与本产品或服务有关的问题及反映的情况，千问千答将在法律规定期限内及时作出回复。</li>
      <li>3. 对于您在千问千答平台上的不当行为，或任何千问千答认为应当终止服务的情况，千问千答有权实施屏蔽相关信息、终止提供服务等处理措施，并将相关情况及时通知于您和告知有关部门；您对千问千答的处理措施存在异议的，可以提供相关证据予以说明。若经核实，您的行为确有违反本平台用户协议或违法违规情况的，千问千答有权终止对您提供服务。</li>
      <li>4. 为不断改善千问千答的服务质量，千问千答可能使用您输入千问千答的和千问千答向您输出的内容进行进一步的开发训练。您完全理解并接受该种使用，并不因该种使用而向千问千答主张权利或主张千问千答侵犯您的权益。</li>
      <li>5. 千问千答将尽最大努力、采取必要合理措施，保障千问千答网络安全和稳定运行。</li>
      <li>6. 如千问千答为您提供免费服务的，您理解并同意，该种免费使用可能根据研究进展进行调整。您承诺不会因该规则的调整、免费使用权益的失效而向千问千答追究任何责任。</li>
      <li>7. 您不得以任何方式删除、篡改、隐匿千问千答在输出内容中生成的深度合成服务标识。</li>
    </ul>

    <h2>您的权利和义务</h2>
    <ul>
      <li>1. 您有权根据本协议的约定享受千问千答提供的以下服务：问答对话生成服务。千问千答有权依据业务需要增加或减少服务的内容。</li>
      <li>2. 您应当保证在使用千问千答时不采取不正当行为，不扰乱平台正常秩序。</li>
      <li>3. 您不得向千问千答输出或诱导千问千答向您输出包含以下内容的言论，否则千问千答平台可对您发布的信息依法或依本协议进行删除或屏蔽，并将您发布信息的情况和向有关机关报告：</li>
      <ul>
        <li>煽动、抗拒、破坏宪法和法律、行政法规实施的；</li>
        <li>煽动颠覆国家政权，推翻社会主义制度的；</li>
        <li>煽动、分裂国家，破坏国家统一的；</li>
        <li>煽动民族仇恨、民族歧视，破坏民族团结的；</li>
        <li>任何包含对种族、性别、宗教、地域内容等歧视的；</li>
        <li>捏造或者歪曲事实，散布谣言，扰乱社会秩序的；</li>
        <li>宣扬封建迷信、淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪的；</li>
      </ul>
    </ul>
  </div>
</template>
<script setup>
defineProps({
  height: {
    type: String,
    default: '660px'
  }
});
</script>
<style lang='scss' scoped>
.privacy-policy{
    overflow: auto;
    line-height: 26px;
    p{
        text-indent: 2em;
    }
    li{
        list-style-type: disc;
        color: #666;
    }
}
</style>