<template>
  <div class="privacy-policy" :style="{ 'height': height }">
    <h1 style="text-align: center;">用户隐私协议</h1>
    <p>协议发布及生效日期：2024 年 5 月 5 日起</p>

    <h2>用户隐私协议</h2>
    <p>以下协议详细介绍了合肥达朴汇联科技有限公司（以下简称“我们”）会如何通过其提供的服务收集、使用、共享、存储和保护您的个人信息，以及您可以如何管理您的个人信息。在您开始使用我们的产品和服务前，请您务必先仔细阅读和理解本政策，确保您充分理解和同意后再开始使用。</p>
    
    <h2>用户信息搜集</h2>
    <p>为了确保能够向您提供服务，我们主要会基于如下维度处理您的个人信息：</p>
    <ul>
      <li>1.	账户信息：当您申请使用平台时，需要向我们提供您的手机号以及验证码以完成注册及登录，为了确保您能够成功访问服务，我们将记录此信息。</li>
      <li>2.	对话信息：为了确保服务的质量和稳定性，在您使用平台服务时，我们将收集您在产品交互过程中所输入的文本数据信息。</li>
      <li>3.	麦克风权限：当您发送语音消息时，我们会申请使用您的麦克风权限。这一过程对于确保服务的质量和精确性至关重要。如果您选择不授予这些权限，您将无法使用语音识别功能。</li>
      <li>4.	设备信息及个人用户标识：当您使用我们的服务时，可能会涉及到第三方 SDK 的使用。这些 SDK 可能会请求访问您的设备权限，以便在不同的手机设备或第三方平台上提供和维护功能。这些权限可能包括但不限于获取您的设备信息（如 IMEI / 设备唯一标识符 / 设备 MAC 地址 - SID / Android ID / OAID 等）。如果您希望了解更多关于我们所集成的第三方 SDK 的详细信息，我们建议您查阅下方的 第三方 SDK 隐私协议说明。</li>
    </ul>

    <h2>第三方 SDK 隐私协议说明</h2>
    <h3>中国移动认证</h3>
    <p>使用目的：识别⽤户的⼿机号码快速登录/号码校验，问题查询、分析、风险控制</p>
    <p>涉及个人信息：网络类型、网络地址、运营商类型、本机手机号、手机设备类型、手机操作系统、硬件厂商</p>
    <p>信息处理方式：SDK 自行采集</p>
    <p>第三方主体：中移互联网有限公司</p>
    <p>官网链接/隐私政策：https://wap.cmpassport.com/resources/html/contract.html</p>
    <h3>中国联通认证</h3>
    <p>使用目的：识别⽤户的⼿机号码快速登录/业务风控</p>
    <p>涉及个人信息：网络类型、网络地址、运营商类型、本机号码信息、SIM 卡状态、手机设备类型、手机操作系统、硬件厂商</p>
    <p>信息处理方式：SDK 自行采集</p>
    <p>第三方主体：中国联合网络通信有限公司</p>
    <p>官网链接/隐私政策：https://opencloud.wostore.cn/authz/resource/html/disclaimer.html?fromsdk=true</p>
    <h3>中国联通认证</h3>
    <p>使用目的：识别⽤户的⼿机号码快速登录/号码校验及业务风控</p>
    <p>涉及个人信息：国际移动用户标识码、应用进程信息、注册手机号码、本机号码、网络连接类型、网络状态信息、网络地址、运营商类型、手机设备类型、手机设备厂商、手机操作系统类型及版本</p>
    <p>信息处理方式：SDK 自行采集</p>
    <p>第三方主体：天翼数字生活科技有限公司</p>
    <p>官网链接/隐私政策：https://e.189.cn/sdk/agreement/show.do?order=2&type=main&appKey=&hidetop=&isShowPre=&returnUrl=https%3A%2F%2Fe.189.cn</p>
    
    <h2>用户信息管理</h2>
    <p>您可以以下方式处理您的用户信息：</p>
    <h3>信息基本处理</h3>
    <p>您有权修改、查询、复制您的个人信息或者将您的个人信息转移至其他指定信息处理者。在符合相关法律法规并核实确认您的用户身份的前提下，您可以通过 dapp@dappworks.cn 向我们提出具体处理需求，我们将在15个工作日内予以反馈。</p>
    <h3>信息删除</h3>
    <p>在符合相关法律法规并核实确认您的用户身份的前提下，您可以向我们提出信息删除需求。您可以删除您账户的问答历史，通过点击【清空历史记录】，即可执行此类操作。</p>
    <p>在以下情形中，您可以向我们提出删除个人信息的请求，您可以通过【dapp@dappworks.cn】随时与我们联系：</p>
    <ul>
      <li>1. 如果我们违反法律法规或与您的约定收集、使用、与他人共享或转让您的个人信息；</li>
      <li>2. 如果我们违反法律法规规定或与您的约定，公开披露您的个人信息，您有权要求我们立即停止公开披露的行为，并发布通知要求相关接收方删除相应的信息。</li>
    </ul>
    <p>我们将在15个工作日内予以反馈。一旦删除请求被响应，您的个人信息将被删除或匿名化处理，并在平台系统更新时进行删除。</p>

    <h2>用户信息保护</h2>
    <p>我们非常重视用户个人信息的保护。我们将采取一系列技术措施、组织和管理制度，以及风险应对措施来确保用户个人数据的安全。在本说明中，我们将详细解释我们为保护用户个人数据所采取的各项措施。</p>
    <h3>个人数据安全处理技术</h3>
    <p>数据加密：我们将会采用业界领先的加密算法对用户个人信息进行加密处理，以确保即使数据被未经授权的第三方获取，他们也无法解析出用户的实际信息。数据传输安全：我们采用加密技术为用户与服务器间的通信提供可靠的加密保护，确保数据在传输过程中不被截获或篡改。系统安全防护：我们定期对服务器和系统进行安全检查与漏洞修补，以防止黑客的攻击和病毒的入侵。</p>
    <h3>组织和管理制度方面的措施</h3>
    <p>成立专门的数据保护部门，并指定负责人，负责用户个人信息的保护工作。定期对公司员工进行个人信息保护的培训和教育，确保全体员工了解和重视对用户个人信息的保护工作。严格限制公司员工对用户数据的访问权限，仅在业务需要时允许特定员工访问有关数据。访问用户个人信息的员工进行监督和考核，发现行为不当及时处理，并将其纳入员工的绩效考核。</p>
    <h3>应对潜在的数据泄露和丢失等风险的措施</h3>
    <p>数据备份：我们会定期对用户个人信息数据进行备份，并将备份数据存储在不同的物理位置，以降低因意外或灾难造成数据丢失的风险。数据泄露预警：我们设立了实时监控系统，对异常数据访问和泄露情况进行监控，一旦发现数据泄露迹象，我们将立即采取措施阻止泄露，果断查找原因并制定相应改进措施。用户权益保障：在发生个人信息泄露事件时，我们承诺将主动告知用户，并提供有关事件的详细信息及我们采取的应对措施。我们还将依据法律法规的要求，承担因信息泄露造成的法律责任。</p>

    <h2>联系我们</h2>
    <p>如您在使用本产品时对协议有任何问题，可通过发送邮件至 dapp@dappworks.cn 或通过本产品意见反馈渠道或网站上标识的方式与我们联系。</p>
  </div>
</template>
<script setup>
defineProps({
  height: {
    type: String,
    default: '660px'
  }
});
</script>
<style lang='scss' scoped>
.privacy-policy{
    overflow: auto;
    line-height: 26px;
    p{
        text-indent: 2em;
    }
    li{
        list-style-type: disc;
        color: #666;
    }
}
</style>